# Mukesh Kumar Sanodiya (14-Jan-2019)

# 8.PANDAS SQL 1 & SQL 2-Assignment-1

# Problem Statement
Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/

Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names

In [2]:
import pandas as pd
AD_df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
AD_df.head(5)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

# Rename Columns

In [4]:
AD_df.columns =["Age","WorkClass","SomeNumer","Education","Education_Number","Marital_Status"
                ,"Occupation","Relationship","Race","Sex","Capital_Gain","Capital_Loss","Hours_Per_Week",
                "Native_Country","Income"]
AD_df.head(6)

,Age,WorkClass,SomeNumer,Education,Education_Number,Marital_Status,Occupation,Relationship,Race,Sex,Capital_Gain,Capital_Loss,Hours_Per_Week,Native_Country,Income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
5,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K

# Task: Create a sql db from adult dataset and name it sqladb

In [5]:
import sqlalchemy
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb', echo=True)
AD_df.to_sql('sqladb', engine, if_exists='replace')

2019-01-16 23:22:02,245 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2019-01-16 23:22:02,245 INFO sqlalchemy.engine.base.Engine ()
2019-01-16 23:22:02,260 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2019-01-16 23:22:02,276 INFO sqlalchemy.engine.base.Engine ()
2019-01-16 23:22:02,291 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("sqladb")
2019-01-16 23:22:02,291 INFO sqlalchemy.engine.base.Engine ()
2019-01-16 23:22:02,323 INFO sqlalchemy.engine.base.Engine
CREATE TABLE sqladb (
	"index" BIGINT,
	"Age" BIGINT,
	"WorkClass" TEXT,
	"SomeNumer" BIGINT,
	"Education" TEXT,
	"Education_Number" BIGINT,
	"Marital_Status" TEXT,
	"Occupation" TEXT,
	"Relationship" TEXT,
	"Race" TEXT,
	"Sex" TEXT,
	"Capital_Gain" BIGINT,
	"Capital_Loss" BIGINT,
	"Hours_Per_Week" BIGINT,
	"Native_Country" TEXT,
	"Income" TEXT
)


2019-01-16 23:22:02,338 INFO sqlalchemy.engine.base.Engine ()
2019-01-16 23:22:02,463 INFO sqlalchemy.engine.base.Engine COMMIT
2019-01-16 23:22:02,479 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_sqladb_index ON sqladb ("index")
2019-01-16 23:22:02,479 INFO sqlalchemy.engine.base.Engine ()
2019-01-16 23:22:02,589 INFO sqlalchemy.engine.base.Engine COMMIT
2019-01-16 23:22:02,683 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2019-01-16 23:22:04,447 INFO sqlalchemy.engine.base.Engine INSERT INTO sqladb ("index", "Age", "WorkClass", "SomeNumer", "Education", "Education_Number", "Marital_Status", "Occupation", "Relationship", "Race", "Sex", "Capital_Gain", "Capital_Loss", "Hours_Per_Week", "Native_Country", "Income") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2019-01-16 23:22:04,447 INFO sqlalchemy.engine.base.Engine ((0, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'), (1, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (2, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'), (3, 28, ' Private', 338409, ' Bachelors', 13, ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', 0, 0, 40, ' Cuba', ' <=50K'), (4, 37, ' Private', 284582, ' Masters', 14, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (5, 49, ' Private', 160187, ' 9th', 5, ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', 0, 0, 16, ' Jamaica', ' <=50K'), (6, 52, ' Self-emp-not-inc', 209642, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 45, ' United-States', ' >50K'), (7, 31, ' Private', 45781, ' Masters', 14, ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', 14084, 0, 50, ' United-States', ' >50K')  ... displaying 10 of 32560 total bound parameter sets ...  (32558, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'), (32559, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K'))
2019-01-16 23:22:05,197 INFO sqlalchemy.engine.base.Engine COMMIT

# Q1. Select 10 records from the adult sqladb

In [8]:
import sqlite3
connection = sqlite3.connect("sqladb")
cursor = connection.cursor()
print(pd.read_sql_query('SELECT * FROM sqladb limit 10', connection))

   index  Age          WorkClass  SomeNumer      Education  Education_Number  \
0      0   50   Self-emp-not-inc      83311      Bachelors                13
1      1   38            Private     215646        HS-grad                 9
2      2   53            Private     234721           11th                 7
3      3   28            Private     338409      Bachelors                13
4      4   37            Private     284582        Masters                14
5      5   49            Private     160187            9th                 5
6      6   52   Self-emp-not-inc     209642        HS-grad                 9
7      7   31            Private      45781        Masters                14
8      8   42            Private     159449      Bachelors                13
9      9   37            Private     280464   Some-college                10

           Marital_Status          Occupation    Relationship    Race  \
0      Married-civ-spouse     Exec-managerial         Husband   White
1                Divorced   Handlers-cleaners   Not-in-family   White
2      Married-civ-spouse   Handlers-cleaners         Husband   Black
3      Married-civ-spouse      Prof-specialty            Wife   Black
4      Married-civ-spouse     Exec-managerial            Wife   White
5   Married-spouse-absent       Other-service   Not-in-family   Black
6      Married-civ-spouse     Exec-managerial         Husband   White
7           Never-married      Prof-specialty   Not-in-family   White
8      Married-civ-spouse     Exec-managerial         Husband   White
9      Married-civ-spouse     Exec-managerial         Husband   Black

       Sex  Capital_Gain  Capital_Loss  Hours_Per_Week  Native_Country  Income
0     Male             0             0              13   United-States   <=50K
1     Male             0             0              40   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3   Female             0             0              40            Cuba   <=50K
4   Female             0             0              40   United-States   <=50K
5   Female             0             0              16         Jamaica   <=50K
6     Male             0             0              45   United-States    >50K
7   Female         14084             0              50   United-States    >50K
8     Male          5178             0              40   United-States    >50K
9     Male             0             0              80   United-States    >50K

# Q2. Show me the average hours per week of all men who are working in private sector

In [11]:
cursor.execute('SELECT avg(Hours_Per_Week) FROM sqladb WHERE workclass=" Private"')
output = cursor.fetchall()
print("Average Hours Per week of all Men who are working in Private Sector is : ",output)

Average Hours Per week of all Men who are working in Private Sector is :  [(40.267095523440254,)]

# Q3. Show me the frequency table for education, occupation and relationship, separately

In [12]:
cursor.execute('SELECT Education, COUNT(*) FROM sqladb GROUP BY Education')
output = cursor.fetchall()
print(output)

[(' 10th', 933), (' 11th', 1175), (' 12th', 433), (' 1st-4th', 168), (' 5th-6th', 333), (' 7th-8th', 646), (' 9th', 514), (' Assoc-acdm', 1067), (' Assoc-voc', 1382), (' Bachelors', 5354), (' Doctorate', 413), (' HS-grad', 10501), (' Masters', 1723), (' Preschool', 51), (' Prof-school', 576), (' Some-college', 7291)]

In [13]:
cursor.execute('SELECT Occupation, COUNT(*) FROM sqladb GROUP BY Occupation')
output = cursor.fetchall()
print(output)

[(' ?', 1843), (' Adm-clerical', 3769), (' Armed-Forces', 9), (' Craft-repair', 4099), (' Exec-managerial', 4066), (' Farming-fishing', 994), (' Handlers-cleaners', 1370), (' Machine-op-inspct', 2002), (' Other-service', 3295), (' Priv-house-serv', 149), (' Prof-specialty', 4140), (' Protective-serv', 649), (' Sales', 3650), (' Tech-support', 928), (' Transport-moving', 1597)]

In [14]:
cursor.execute('SELECT Relationship, COUNT(*) FROM sqladb GROUP BY Relationship')
output = cursor.fetchall()
print(output)

[(' Husband', 13193), (' Not-in-family', 8304), (' Other-relative', 981), (' Own-child', 5068), (' Unmarried', 3446), (' Wife', 1568)]

# Q4. Are there any people who are married, working in private sector and having a masters degree

In [15]:
print(pd.read_sql_query('SELECT * FROM sqladb WHERE Education=" Masters" AND WorkClass=" Private" AND Marital_Status=" Married-civ-spouse"',
                        connection).head(10))

   index  Age WorkClass  SomeNumer Education  Education_Number  \
0      4   37   Private     284582   Masters                14
1     86   33   Private     202051   Masters                14
2     99   76   Private     124191   Masters                14
3    187   31   Private      99928   Masters                14
4    197   35   Private     138992   Masters                14
5    310   34   Private     142897   Masters                14
6    360   62   Private     270092   Masters                14
7    404   41   Private     445382   Masters                14
8    434   33   Private     208405   Masters                14
9    467   49   Private     192776   Masters                14

        Marital_Status        Occupation     Relationship  \
0   Married-civ-spouse   Exec-managerial             Wife
1   Married-civ-spouse    Prof-specialty          Husband
2   Married-civ-spouse   Exec-managerial          Husband
3   Married-civ-spouse    Prof-specialty             Wife
4   Married-civ-spouse    Prof-specialty   Other-relative
5   Married-civ-spouse   Exec-managerial          Husband
6   Married-civ-spouse    Prof-specialty          Husband
7   Married-civ-spouse   Exec-managerial          Husband
8   Married-civ-spouse    Prof-specialty          Husband
9   Married-civ-spouse   Exec-managerial          Husband

                  Race      Sex  Capital_Gain  Capital_Loss  Hours_Per_Week  \
0                White   Female             0             0              40
1                White     Male             0             0              50
2                White     Male             0             0              40
3                White   Female             0             0              50
4                White     Male          7298             0              40
5   Asian-Pac-Islander     Male          7298             0              35
6                White     Male             0             0              40
7                White     Male             0          1977              65
8                White     Male             0             0              50
9                White     Male             0          1977              45

   Native_Country  Income
0   United-States   <=50K
1   United-States   <=50K
2   United-States    >50K
3   United-States   <=50K
4   United-States    >50K
5          Taiwan    >50K
6   United-States    >50K
7   United-States    >50K
8   United-States    >50K
9   United-States    >50K

# Q5. What is the average, minimum and maximum age group for people working in different sectors

In [17]:
cursor.execute('SELECT occupation, min(age),max(age),avg(age) FROM sqladb GROUP BY occupation')
output = cursor.fetchall()
display(output)

[(' ?', 17, 90, 40.882799782962564),
 (' Adm-clerical', 17, 90, 36.96391615813213),
 (' Armed-Forces', 23, 46, 30.22222222222222),
 (' Craft-repair', 17, 90, 39.03147109050988),
 (' Exec-managerial', 17, 90, 42.16920806689621),
 (' Farming-fishing', 17, 90, 41.2112676056338),
 (' Handlers-cleaners', 17, 90, 32.16569343065694),
 (' Machine-op-inspct', 17, 90, 37.71528471528472),
 (' Other-service', 17, 90, 34.94962063732929),
 (' Priv-house-serv', 17, 81, 41.7248322147651),
 (' Prof-specialty', 17, 90, 40.51763285024155),
 (' Protective-serv', 17, 90, 38.9537750385208),
 (' Sales', 17, 90, 37.353972602739724),
 (' Tech-support', 17, 73, 37.022629310344826),
 (' Transport-moving', 17, 90, 40.19787100814026)]

# Q6. Calculate age distribution by country

In [18]:
cursor.execute('SELECT Native_Country, min(age),max(age),avg(age) FROM sqladb GROUP BY Native_Country')
output = cursor.fetchall()
display(output)

[(' ?', 17, 90, 38.72555746140652),
 (' Cambodia', 18, 65, 37.78947368421053),
 (' Canada', 17, 80, 42.54545454545455),
 (' China', 22, 75, 42.53333333333333),
 (' Columbia', 18, 75, 39.71186440677966),
 (' Cuba', 21, 82, 45.76842105263158),
 (' Dominican-Republic', 18, 78, 37.72857142857143),
 (' Ecuador', 21, 90, 36.642857142857146),
 (' El-Salvador', 17, 79, 34.132075471698116),
 (' England', 17, 90, 41.15555555555556),
 (' France', 20, 64, 38.96551724137931),
 (' Germany', 18, 74, 39.25547445255474),
 (' Greece', 22, 65, 46.206896551724135),
 (' Guatemala', 19, 66, 32.421875),
 (' Haiti', 17, 63, 38.27272727272727),
 (' Holand-Netherlands', 32, 32, 32.0),
 (' Honduras', 18, 58, 33.84615384615385),
 (' Hong', 19, 60, 33.65),
 (' Hungary', 24, 81, 49.38461538461539),
 (' India', 17, 61, 38.09),
 (' Iran', 22, 63, 39.41860465116279),
 (' Ireland', 23, 68, 36.458333333333336),
 (' Italy', 19, 77, 46.42465753424658),
 (' Jamaica', 18, 66, 35.592592592592595),
 (' Japan', 19, 61, 38.24193548387097),
 (' Laos', 19, 56, 34.72222222222222),
 (' Mexico', 17, 81, 33.29082426127527),
 (' Nicaragua', 19, 67, 33.61764705882353),
 (' Outlying-US(Guam-USVI-etc)', 21, 63, 38.714285714285715),
 (' Peru', 17, 69, 35.25806451612903),
 (' Philippines', 17, 90, 39.44444444444444),
 (' Poland', 17, 85, 43.11666666666667),
 (' Portugal', 19, 78, 40.2972972972973),
 (' Puerto-Rico', 17, 90, 40.50877192982456),
 (' Scotland', 18, 62, 40.416666666666664),
 (' South', 19, 90, 38.75),
 (' Taiwan', 20, 61, 33.8235294117647),
 (' Thailand', 19, 55, 34.94444444444444),
 (' Trinadad&Tobago', 17, 61, 41.31578947368421),
 (' United-States', 17, 90, 38.65566183276766),
 (' Vietnam', 19, 73, 34.059701492537314),
 (' Yugoslavia', 20, 66, 38.8125)]

# Q7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'

In [19]:
cursor.execute('UPDATE sqladb SET capital_gain=capital_gain-capital_loss')

In [20]:
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  Age          WorkClass  SomeNumer   Education  Education_Number  \
0      0   50   Self-emp-not-inc      83311   Bachelors                13
1      1   38            Private     215646     HS-grad                 9
2      2   53            Private     234721        11th                 7
3      3   28            Private     338409   Bachelors                13
4      4   37            Private     284582     Masters                14

        Marital_Status          Occupation    Relationship    Race      Sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   Capital_Gain  Capital_Loss  Hours_Per_Week  Native_Country  Income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [21]:

connection.close()